Importing all Neccessary Libraries

In [1]:
import numpy as mp
import pandas as pd
import math
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn import metrics

In [2]:
flightData = pd.read_csv("flightdata.csv")
flightData.head()

,YEAR,QUARTER,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,UNIQUE_CARRIER,TAIL_NUM,FL_NUM,ORIGIN_AIRPORT_ID,ORIGIN,...,CRS_ARR_TIME,ARR_TIME,ARR_DELAY,ARR_DEL15,CANCELLED,DIVERTED,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,DISTANCE,Unnamed: 25
0,2016,1,1,1,5,DL,N836DN,1399,10397,ATL,...,2143,2102.0,-41.0,0.0,0.0,0.0,338.0,295.0,2182.0,NaN
1,2016,1,1,1,5,DL,N964DN,1476,11433,DTW,...,1435,1439.0,4.0,0.0,0.0,0.0,110.0,115.0,528.0,NaN
2,2016,1,1,1,5,DL,N813DN,1597,10397,ATL,...,1215,1142.0,-33.0,0.0,0.0,0.0,335.0,300.0,2182.0,NaN
3,2016,1,1,1,5,DL,N587NW,1768,14747,SEA,...,1335,1345.0,10.0,0.0,0.0,0.0,196.0,205.0,1399.0,NaN
4,2016,1,1,1,5,DL,N836DN,1823,14747,SEA,...,607,615.0,8.0,0.0,0.0,0.0,247.0,259.0,1927.0,NaN

In [3]:
flightData.isnull().sum()

YEAR                       0
QUARTER                    0
MONTH                      0
DAY_OF_MONTH               0
DAY_OF_WEEK                0
UNIQUE_CARRIER             0
TAIL_NUM                   0
FL_NUM                     0
ORIGIN_AIRPORT_ID          0
ORIGIN                     0
DEST_AIRPORT_ID            0
DEST                       0
CRS_DEP_TIME               0
DEP_TIME                 107
DEP_DELAY                107
DEP_DEL15                107
CRS_ARR_TIME               0
ARR_TIME                 115
ARR_DELAY                188
ARR_DEL15                188
CANCELLED                  0
DIVERTED                   0
CRS_ELAPSED_TIME           0
ACTUAL_ELAPSED_TIME      188
DISTANCE                   0
Unnamed: 25            11231
dtype: int64

Removing the Unnamed Column

In [4]:
flightData.columns.str.match("Unnamed")
flightData.drop("Unnamed: 25",axis = 1,inplace = True)

Filtering Neccessary Data

In [5]:
flightData = flightData[["FL_NUM","MONTH","DAY_OF_MONTH","DAY_OF_WEEK","ORIGIN","DEST","CRS_ARR_TIME","DEP_DEL15","ARR_DEL15"]]
flightData.isnull().sum()

FL_NUM            0
MONTH             0
DAY_OF_MONTH      0
DAY_OF_WEEK       0
ORIGIN            0
DEST              0
CRS_ARR_TIME      0
DEP_DEL15       107
ARR_DEL15       188
dtype: int64

Filling Nulll Values

In [6]:
flightData = flightData.fillna({"ARR_DEL15":1})
flightData = flightData.fillna({"DEP_DEL15":0})
flightData.isnull().sum()

FL_NUM          0
MONTH           0
DAY_OF_MONTH    0
DAY_OF_WEEK     0
ORIGIN          0
DEST            0
CRS_ARR_TIME    0
DEP_DEL15       0
ARR_DEL15       0
dtype: int64

In [7]:
for index , row in flightData.iterrows():
  flightData.loc[index, "CRS_ARR_TIME"] = math.floor(row["CRS_ARR_TIME"]/100)
flightData.head()

,FL_NUM,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,ORIGIN,DEST,CRS_ARR_TIME,DEP_DEL15,ARR_DEL15
0,1399,1,1,5,ATL,SEA,21,0.0,0.0
1,1476,1,1,5,DTW,MSP,14,0.0,0.0
2,1597,1,1,5,ATL,SEA,12,0.0,0.0
3,1768,1,1,5,SEA,MSP,13,0.0,0.0
4,1823,1,1,5,SEA,DTW,6,0.0,0.0

Using label Encoder to encode categorical values

In [8]:
labelEncoder = LabelEncoder()
flightData["ORIGIN"] = labelEncoder.fit_transform(flightData["ORIGIN"])
flightData["DEST"] = labelEncoder.fit_transform(flightData["DEST"])
flightData.head()

,FL_NUM,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,ORIGIN,DEST,CRS_ARR_TIME,DEP_DEL15,ARR_DEL15
0,1399,1,1,5,0,4,21,0.0,0.0
1,1476,1,1,5,1,3,14,0.0,0.0
2,1597,1,1,5,0,4,12,0.0,0.0
3,1768,1,1,5,4,3,13,0.0,0.0
4,1823,1,1,5,4,1,6,0.0,0.0

Spliting Dependent and independent Values from the dataset

In [9]:
independentVar = flightData.iloc[:,0:8]
dependentVar = flightData.iloc[:,8:9]
dependentVar.head()

   ARR_DEL15
0        0.0
1        0.0
2        0.0
3        0.0
4        0.0

Spliting testing and training data

In [10]:
independentVar_train ,independentVar_test , dependentVar_train , dependentVar_test = train_test_split(independentVar,dependentVar,test_size=0.2,random_state=0)

In [18]:
independentVar_test.head()

,FL_NUM,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,ORIGIN,DEST,CRS_ARR_TIME,DEP_DEL15
10559,39,12,9,5,1,4,10,0.0
9494,2308,11,6,7,4,3,18,0.0
1460,984,2,25,4,0,2,23,0.0
3299,2350,4,4,1,0,2,10,0.0
2456,2283,3,30,3,1,0,8,0.0

In [12]:
independentVar_train.shape

(8984, 8)

In [13]:
dependentVar_test.shape

(2247, 1)

In [14]:
dependentVar_train.shape

(8984, 1)

Creating Decision Tree Model

In [15]:
decisionTreeModel = DecisionTreeClassifier()
decisionTreeModel = decisionTreeModel.fit(independentVar_train,dependentVar_train)
dependentVar_predicted = decisionTreeModel.predict(independentVar_test)

print("Accuracy :" ,metrics.accuracy_score(dependentVar_test, dependentVar_predicted))

Accuracy : 0.8615932354250111